# 形式的なレース名(頻出のもの)
STANDARD_RACE_NAMES = [
    "2歳新馬",
    "2歳未勝利",
    "3歳新馬",
    "3歳未勝利",
    "3歳1勝クラス",
    "3歳以上1勝クラス",
    "3歳以上2勝クラス",
    "3歳以上3勝クラス",
    "4歳以上1勝クラス",
    "4歳以上2勝クラス",
    "4歳以上3勝クラス",
    "3歳オープン",
    "オープン",
]

# GIレース(JRA)
G1_RACE_NAMES = [
    "フェブラリーS", "高松宮記念", "大阪杯", "桜花賞", "皐月賞",
    "天皇賞(春)", "NHKマイルC", "ヴィクトリアM", "オークス", "日本ダービー",
    "安田記念", "宝塚記念", "スプリンターズS", "秋華賞", "菊花賞",
    "天皇賞(秋)", "エリザベス女王杯", "マイルCS", "ジャパンC", "チャンピオンズC",
    "阪神JF", "朝日杯FS", "有馬記念", "ホープフルS",
]

RACE_NAME_PRESETS = STANDARD_RACE_NAMES + G1_RACE_NAMES